In [20]:
#csv: commma seperated values, 
#import essential libraries
import pandas as pd
import numpy as np

In [21]:
#series examples
arr = np.linspace(1,10,10)
arr

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.])

In [22]:
ser= pd.Series(arr)
ser

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

In [23]:
#dataframe examples
data = {
     "emp_id" : [1001,1002,1003,1004,1005],
     "emp_name":["Tanya","Vaidehi","Shubhi","Drishti","Siya"],
     "Salary":[50000,55000,50000,52000,56000]
}

In [24]:
df =pd.DataFrame(data)
df

   emp_id emp_name  Salary
0    1001    Tanya   50000
1    1002  Vaidehi   55000
2    1003   Shubhi   50000
3    1004  Drishti   52000
4    1005     Siya   56000

In [25]:
#store df data in .csv files
df.to_csv("emp.csv",index=None)
print("Data Stored Successfully")

Data Stored Successfully

In [26]:
#read csv files 
df2 =pd.read_csv("dtsvm.csv")
df2

      User ID  Gender   Age  EstimatedSalary  Purchased
0    15624510    Male  19.0          19000.0          0
1    15810944    Male  35.0          20000.0          0
2    15668575  Female  26.0          43000.0          0
3    15603246  Female  27.0          57000.0          0
4    15804002    Male  19.0          76000.0          0
..        ...     ...   ...              ...        ...
395  15691863  Female  46.0          41000.0          1
396  15706071    Male  51.0          23000.0          1
397  15654296  Female  50.0          20000.0          1
398  15755018    Male  36.0          33000.0          0
399  15594041  Female  49.0          36000.0          1

[400 rows x 5 columns]

In [27]:
df2.head(2) #top 2 rows

    User ID Gender   Age  EstimatedSalary  Purchased
0  15624510   Male  19.0          19000.0          0
1  15810944   Male  35.0          20000.0          0

In [28]:
df2.tail(2)

      User ID  Gender   Age  EstimatedSalary  Purchased
398  15755018    Male  36.0          33000.0          0
399  15594041  Female  49.0          36000.0          1

In [29]:
# shape: displays no of rows & columns
df2.shape

(400, 5)

In [30]:
#info: function of df & gives all info about ur ds 
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              398 non-null    float64
 3   EstimatedSalary  398 non-null    float64
 4   Purchased        400 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 15.8+ KB

In [31]:
#describe: displays various mathematicl calculations regarding datasets
df2.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  398.000000       398.000000  400.000000
mean   1.569154e+07   37.680905     69804.020101    0.357500
std    7.165832e+04   10.501346     34107.428206    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.250000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [32]:
#isNull() :missing values finder
df2.isnull().sum()

User ID            0
Gender             0
Age                2
EstimatedSalary    2
Purchased          0
dtype: int64

In [33]:
#handling missing values using  function
df2 =df2.drop("Gender",axis="columns")

In [34]:
df2.mean()

User ID            1.569154e+07
Age                3.768090e+01
EstimatedSalary    6.980402e+04
Purchased          3.575000e-01
dtype: float64

In [35]:
df2=df2.fillna(df2.mean())

In [36]:
df2.isnull().sum()

User ID            0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64